Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd


series = pd.Series([4,8,15,16,23,42])

series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
type(series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas as pd


import numpy as np


data = np.array(['a', 'b', 'c', 'd', 'e','f','g','h','i','j'])

series = pd.Series(data)
series

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [4]:
import pandas as pd


series = pd.Series([10, 20, 30, 40, 50,60,70,80,90,100])

series

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following

In [5]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Claire'],
		'Age': [25, 30, 27],
       'Gender': ['Female','Male','Female']}


df = pd.DataFrame(data)


df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Series is a type of list in pandas which can take integer values, string values, double values and more. ...

Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data

series example

import pandas as pd

series = pd.Series([4,8,15,16,23,42])

print(series)

type(series)

In [7]:
# dataframe example 

import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Claire'],
		'Age': [25, 30, 27],
       'Gender': ['Female','Male','Female']}


df = pd.DataFrame(data)

print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Functions used in dataframe:

1. head() : to get top 5

2. tail() : to get bottom 5

3. describe(): to get overviewed analysis of data

4. column : to get column names

5. iloc/loc : for slicing the row based on condition

6. dtypes : to get datatypes

In [9]:
# use of describe to get starting analysis of data

df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Dataframe is mutable

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.

Series is size immutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [10]:
# ex:1
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df1=pd.concat([courses,fees,discount],axis=1)
print(df1)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000

When we combine multiple pandas Series into a DataFrame, it creates a DataFrame with the number of columns equivalent to number of series we are merging